{"participants": [{"name": "Harry Potter"}, {"name": "Draco Malfoy"}], "messages": [{"sender_name": "Harry Potter", "timestamp_ms": 1577836800000, "content": "Malfoy. Fancy seeing you here."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1577836850000, "content": "Potter. I could say the same to you. Come to gawk at broomsticks you can't afford?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1577836900000, "content": "Just looking, thanks. I notice your goons Crabbe and Goyle aren't glued to your side today. Finally learned to go places without your bodyguards?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1577836950000, "content": "Hilarious, Potter. For your information, I don't need anyone to protect me from the likes of you."}, {"sender_name": "Harry Potter", "timestamp_ms": 1577837000000, "content": "Could have fooled me, after how often you hide behind them. How's your dad enjoying Azkaban? Give him my best."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1577837050000, "content": "You'll pay for that one, Potter. Just you wait until my father hears about this."}, {"sender_name": "Harry Potter", "timestamp_ms": 1577837100000, "content": "Ooh, I'm so scared. What's daddy's little Death Eater gonna do, write a strongly worded letter?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1577837150000, "content": "You'll regret mocking me someday, Potter. People like you always get what's coming to them."}, {"sender_name": "Harry Potter", "timestamp_ms": 1577837200000, "content": "Is that a threat, Malfoy? Didn't peg you as brave enough to threaten me to my face."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1577837250000, "content": "No need for threats. You'll slip up eventually, Scarhead, and I'll be there waiting when you do."}, {"sender_name": "Harry Potter", "timestamp_ms": 1577837300000, "content": "Whatever helps you sleep at night. See you at Hogwarts."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515200000, "content": "Well, well, if it isn't the famous Harry Potter. Come to show off your new broomstick?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515250000, "content": "Shove off, Malfoy. Don't you have first years to torment or something?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515300000, "content": "Testy today, aren't we? The Dementors getting under your skin at the match?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515350000, "content": "The only thing getting under my skin is you. Why don't you slither back to the dungeons?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515400000, "content": "Careful, Potter. You shouldn't go picking fights when you can barely stay conscious around a few Dementors."}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515450000, "content": "Shove off, Malfoy. At least I don't run crying to daddy at the first sign of trouble."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515500000, "content": "My father will hear about your attitude, Potter. And about that bloody chicken you call a Hippogriff."}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515550000, "content": "Going to sick your dad on Buckbeak, eh? You're even more pathetic than I thought."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515600000, "content": "Laugh all you want, Potter, but that beast will pay for what it did to me."}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515650000, "content": "What, scratched your fragile ego? Get over it and leave Buckbeak alone."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515700000, "content": "That monster nearly took my arm off! But a scarhead like you wouldn't understand."}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515750000, "content": "Stop being so dramatic. It was a scratch and you know it."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1580515800000, "content": "Just wait until that beast gets the axe. We'll see who's dramatic then."}, {"sender_name": "Harry Potter", "timestamp_ms": 1580515850000, "content": "You spoiled git. I won't let you get Buckbeak killed just because he bruised your ego."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1583020800000, "content": "Enjoy the show, Potter? Hope you didn't lose your lunch over a few Dementors."}, {"sender_name": "Harry Potter", "timestamp_ms": 1583020850000, "content": "Sod off, Malfoy. Shouldn't you be crying to Snape about your arm that's barely scratched?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1583020900000, "content": "This is no scratch! My arm could be permanently damaged. But I wouldn't expect you to care."}, {"sender_name": "Harry Potter", "timestamp_ms": 1583020950000, "content": "Don't be so dramatic. Madam Pomfrey will fix you right up."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 158302100000, "content": "We'll see if you're still laughing when that bloody chicken gets the axe. I'll make sure of it."}, {"sender_name": "Harry Potter", "timestamp_ms": 1583021050000, "content": "you're going to get Buckbeak executed just because he scratched you? You really are the worst."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1583021100000, "content": "I'm the worst? That beast nearly tore my arm off! It deserves what's coming."}, {"sender_name": "Harry Potter", "timestamp_ms": 1583021150000, "content": "He was just defending himself because you didn't listen to Hagrid! You can't let Buckbeak die for that."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1583021200000, "content": "Watch me, Potter. My father will make sure that chicken gets the axe."}, {"sender_name": "Harry Potter", "timestamp_ms": 1583021250000, "content": "Your father is vile, and so are you. I'll do whatever it takes to save Buckbeak."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1583021300000, "content": "Good luck with that. Not even famous Harry Potter can stop the executioner's axe."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699200000, "content": "Had a good birthday, Potter? Sure you're enjoying your new broomstick."}, {"sender_name": "Harry Potter", "timestamp_ms": 1585699250000, "content": "Sod off, Malfoy. Shouldn't you be waiting for your daily head pat from daddy?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699300000, "content": "Very funny. At least I have a loving family, not like a certain orphan I know."}, {"sender_name": "Harry Potter", "timestamp_ms": 1585699350000, "content": "Don't talk about my family, Malfoy. I have more family than you'll ever know."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699400000, "content": "Oh yes, I forgot about your blood-traitor adoptive family, the Weasleys. Tell me, do they all squeeze into one room at night?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1585699450000, "content": "The Weasleys are worth 10 of you, Malfoy. Don't forget, your family was one of Voldemort's favourites."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699500000, "content": "Don't you dare speak his name! And don't act so high and mighty when you're nothing but a filthy half-blood."}, {"sender_name": "Harry Potter", "timestamp_ms": 1585699550000, "content": "Rather be a half-blood than whatever rotten thing you are. No wonder you hide behind your dad all the time."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699600000, "content": "My father is 10 times the man yours ever was. But you wouldn't know, being orphaned so young and all."}, {"sender_name": "Harry Potter", "timestamp_ms": 1585699650000, "content": "Leave my father out of this, Malfoy. Shouldn't you be off licking your father's boots somewhere?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1585699700000, "content": "Laugh while you can, Potter. We'll see who's licking boots when the Dark Lord returns."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1588291200000, "content": "Come to see the show, Potter? Here for some tips on how to actually catch the Snitch?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1588291250000, "content": "Only here to watch you fail as usual, Malfoy. Surprised your father bought your way onto the team again."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1588291300000, "content": "Jealous I made the team and you didn't, Potter? Not my fault you can't fly well enough."}, {"sender_name": "Harry Potter", "timestamp_ms": 1588291350000, "content": "I'm banned, remember? Not that I'm jealous of your second-rate flying anyway."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1588291400000, "content": "Banned for attacking me after you lost your temper like a troll. Keep it up and you'll stay banned."}, {"sender_name": "Harry Potter", "timestamp_ms": 1588291450000, "content": "You mean after your mate dressed as a Dementor? Real fair match that was."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1588291500000, "content": "Not our fault you can't handle a few fake Dementors, scarhead. Better luck next time."}, {"sender_name": "Harry Potter", "timestamp_ms": 1588291550000, "content": "Just wait until I'm back on a broom, ferret. We'll see who's laughing then."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1588291600000, "content": "I'm trembling. Once a loser, always a loser - that's you, Potter."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1590969600000, "content": "Come to reminisce about the good old days, Potter? Before everyone knew you were lying about He Who Must Not Be Named?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1590969650000, "content": "I'm not lying, Malfoy. But I wouldn't expect a snivelling coward like you to understand."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1590969700000, "content": "Understand what? Your desperate cries for attention? Find a new hobby, Potter."}, {"sender_name": "Harry Potter", "timestamp_ms": 1590969750000, "content": "This isn't about attention. Voldemort is back and I'm going to stop him, no matter what you or the Prophet says."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1590969800000, "content": "Still on about that, are you? The Dark Lord is dead and gone thanks to you. Isn't that enough?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1590969850000, "content": "He's back, and if you had any sense you'd be afraid. But we both know you're nothing but a snivelling coward."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1590969900000, "content": "Believe what you want, Potter. Everyone knows you're off your rocker."}, {"sender_name": "Harry Potter", "timestamp_ms": 1590969950000, "content": "When Voldemort returns, you'll see I was right. Not that you'll do anything but lick his boots."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1590970000000, "content": "If He Who Must Not Be Named does return, my family will be honoured. Unlike blood traitors like the Weasleys."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1593561600000, "content": "Come to join the Inquisitorial Squad, Potter? Finally seen the light?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1593561650000, "content": "In your dreams, Malfoy. I'd rather drink poison than join anything you're part of."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1593561700000, "content": "Pity. You could have finally been somebody, Potter. Though I suppose that ship has sailed."}, {"sender_name": "Harry Potter", "timestamp_ms": 1593561750000, "content": "The only pity here is you flexing what little power Umbridge has given you. How does it feel being her lapdog?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1593561800000, "content": "Being a Hogwarts Inquisitor is an honour. Not that a rule-breaking maniac like you would understand."}, {"sender_name": "Harry Potter", "timestamp_ms": 1593561850000, "content": "The only thing Umbridge is honoured to do is torture students. But you don't care who gets hurt, do you?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1593561900000, "content": "The old hag knows how to keep troublemakers like you in line. Shame detentions haven't cured your attention seeking lies."}, {"sender_name": "Harry Potter", "timestamp_ms": 1593561950000, "content": "One day the truth will come out and you'll regret standing by while she tortured us."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1593562000000, "content": "Spare me the dramatics, Potter. Your rebel days are over, you'd do well to accept that."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1596240000000, "content": "Well, well, look who's back at Hogwarts. Come crawling back, have you, Potter?"}, {"sender_name": "Harry Potter", "timestamp_ms": 1596240050000, "content": "Sod off, Malfoy. Don't you have first years to bully or something?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1596240100000, "content": "Charming as ever I see. No mind, we'll whip you into shape soon enough."}, {"sender_name": "Harry Potter", "timestamp_ms": 1596240150000, "content": "I'd like to see you try. Or are you all talk and no trousers as usual?"}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1596240200000, "content": "Big talk from Dumbledore's pet. This year you'll follow the rules or pay the price."}, {"sender_name": "Harry Potter", "timestamp_ms": 1596240250000, "content": "Whose price? Yours and your Death Eater pals? I'm not afraid of the likes of you."}, {"sender_name": "Draco Malfoy", "timestamp_ms": 1596240300000, "content": "No, you should be afraid of the Dark Lord. And when he takes over, blood traitors like you will be the first to go."}, {"sender_name": "Harry Potter", "timestamp_ms": 1596240350000, "content": "Voldemort doesn't scare me. And neither do his snivelling recruits like you."}], "title": "Draco Malfoy", "is_still_participant": true, "thread_path": "inbox/draco_malfoy_5e1b0e2b4a", "magic_words": []}